subgenre_mapping = {
    "드라마": [
        "해외드라마", "미국드라마", "영국드라마", "중국드라마", "일본드라마",
        "로맨스", "코미디", "판타지", "무협", "공포", "복수", "휴먼",
        "범죄 스릴러/수사극", "의학", "웹툰/소설 원작", "정치/권력", "법정",
        "청춘(성장)", "오피스 드라마", "사극/시대극", "타임슬립"
    ],
    "예능": [
        "버라이어티", "다큐멘터리", "여행", "쿡방/먹방", "연애리얼리티", "게임",
        "토크쇼", "서바이벌", "관찰리얼리티", "스포츠예능", "교육예능", "힐링예능",
        "아이돌리얼리티", "음악서바이벌", "음악예능", "코미디", "가족예능", "뷰티", "애니멀"
    ],
    "영화": [
        "드라마", "로맨스", "코미디", "애니메이션", "스릴러", "미스터리",
        "모험", "액션", "판타지", "SF", "공포", "다큐멘터리"
    ],
    "애니": [
        "키즈"
    ]
}
